namespace Task2._1;

//1. Объявите переменную следующего вида:
    //a.целочисленная переменная, обозначающая возраст.
    //b.строковая переменная для обозначения имени.
    //c.строковая переменная для обозначения названия компании.
    //d.переменная логического типа.
    //e.переменная типа с плавающей точкой для обозначения веса тела человека.

class Program
{
    static void Main(string[] args)
    {
        int Age;
        string Name;
        string CompanyName;
        bool a;
        float Weight;

        Console.WriteLine("Hello, World!");
    }
}

