namespace Practice2.Task10;

//Напишите программу, в которой создаётся массив и выводится на экран
//консоли.Размер массива передавайте в качестве первого аргумента командной
//строки.

class Program
{
    static void Main(string[] args)
    {
        Console.WriteLine("Hello, World!");
    }
}

