namespace Task_2._2;

//Объявите и инициализируйте переменную следующего вида:
    //a.переменная для обозначения возраста человека, имеющая значение вашего возраста.
    //b.переменная, обозначающая ваше имя.
    //c.переменная для обозначения температуры за окном
    //d.переменная логического типа, обозначающая принадлежность к
    //женскому полу.

class Program
{
    static void Main(string[] args)
    {
        int Age = 36;
        string Name = "Denis";
        float Temp = 24;
        bool Women = true;

        Console.WriteLine("Hello, World!");
    }
}

