namespace Practice2.Task7;

//Напишите программу, которая переводит строку в разные регистры
    //a. в верхний регистр: f -> F
    //b. в нижний регистр: F -> f
    //c. делает заглавную букву в слове: привет -> Привет

class Program
{
    static void Main(string[] args)
    {
        Console.WriteLine("Hello, World!");
    }
}